import pandas as pd
import numpy as np
# 1 создание из словаря
data = {
    'Имя': ['Анна', 'Борис', 'Виктор', 'Галина', 'Дмитрий', 'Елена'],
    'Возраст': [25, 30, 35, 28, 40, 33],
    'Город': ['Москва', 'СПб', 'Москва', 'Казань', 'СПб', 'Москва'],
    'Зарплата': [50000, 65000, 80000, 55000, 90000, 60000],
    'Стаж': [2, 5, 8, 3, 12, 6]
}

df = pd.DataFrame(data)
print(df)
# 2 более простой способ с библиотекой numpy
d = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100} # это словарь
ss =  pd.DataFrame(d)
print(ss)
# 3 заменяет порядок столбцов
gr = pd.DataFrame(d, index=[100, 200, 300], columns=['z', 'y', 'x'])
print(gr)
# 4 создание из двумерного массива
l = [[1, 2, 100],
     [2, 4, 100],
     [3, 8, 100]]
xl = pd.DataFrame(l, columns=['x', 'y', 'z']) # обозначение строк
print(xl)
# 5 информация о датафрейме № 1
df.info()
print()
# 6 покажет только первые 3 строки
print("----------------------")
print(df.head(3))
# 7 покажет только последние 2 строки
print("_________________")
print(df.tail(2))
# 8 группирует данные
print("-------------------------------------------")
grouped = df.groupby('Город')['Зарплата'].mean()
print(grouped)
# 9 сортерует данные
print("------------------------------------------")
sort = df.sort_values('Возраст', ascending=False)
print(sort)
# 10 удаление столбцов или строк
print("------------------")
xx = df.drop('Стаж', axis=1)
print(xx)